[
    {
    "id": "5DBA3w1Ol2RxofAmBwcF",
    "originalPrice": null,
    "discount": false,
    "feature": [
    "From our Legends Collection, the Naga was inspired by the mythical water dragon that protects the ocean's pearl. Wear facing inward to be bestowed with love and abundance, or outward for protection."
    ],
    "price": 695,
    "rating": 3.7,
    "imgUrl": "https://fakestoreapi.com/img/71pWzhdJNwL._AC_UL640_QL65_ML3_.jpg",
    "category": "jewellery",
    "name": "John Hardy Women's Legends Naga Gold & Silver Dragon Station Chain Bracelet"
    },
    {
    "id": "BKefMT8Xp6fkJ2kr2Hcd",
    "category": "jewellery",
    "price": 10.99,
    "originalPrice": 16.49,
    "discount": true,
    "rating": 3.9,
    "name": "Pierced Owl Rose Gold Plated Stainless Steel Double",
    "imgUrl": "https://fakestoreapi.com/img/51UDEzMJVpL._AC_UL640_QL65_ML3_.jpg",
    "feature": [
    "Rose Gold Plated Double Flared Tunnel Plug Earrings. Made of 316L Stainless Steel"
    ]
    },
    {
    "id": "CTnjvqcFsQ88Z5WnabKR",
    "discount": false,
    "name": "SanDisk SSD PLUS 1TB Internal SSD - SATA III 6 Gb/s",
    "imgUrl": "https://fakestoreapi.com/img/61U7T1koQqL._AC_SX679_.jpg",
    "originalPrice": null,
    "feature": [
    "Based on published specifications and internal benchmarking tests using PCMark vantage scores) Boosts burst write performance, making it ideal for typical PC workloads",
    "Easy upgrade for faster boot up, shutdown, application load and response (As compared to 5400 RPM SATA 2.5” hard drive",
    "The perfect balance of performance and reliability",
    "Read/write speeds of up to 535MB/s/450MB/s (Based on internal testing; Performance may vary depending upon drive capacity, host device, OS and application.)"
    ],
    "price": 109.95,
    "rating": 4.8,
    "category": "electronics"
    },
    {
    "id": "EsF7F4rH3ugdseLUyD14",
    "originalPrice": 19.99,
    "discount": true,
    "rating": 4.3,
    "imgUrl": "https://fakestoreapi.com/img/71z3kpMAYsL._AC_UY879_.jpg",
    "name": "MBJ Women's Solid Short Sleeve Boat Neck V",
    "price": 16.85,
    "category": "women's clothing",
    "feature": [
    "95% RAYON 5% SPANDEX, Made in USA or Imported, Do Not Bleach, Lightweight fabric with great stretch for comfort, Ribbed on sleeves and neckline / Double stitching on bottom hem"
    ]
    },
    {
    "id": "FhMeqXkT9tj1My2pn7ru",
    "originalPrice": 80,
    "rating": 3.7,
    "imgUrl": "https://images-na.ssl-images-amazon.com/images/I/61EgKv96u2L._AC_SL1000_.jpg",
    "feature": [
    "Smart garage control open and close your garage door from anywhere with your smartphone through the myQ App",
    "Universal – Easy-to-add functionality to upgrade your existing garage door opener. Works with all major brands of garage door openers made after 1993 that have standard safety sensors",
    "Requirements needed to start - a router with 2.4 gigahertz Wi-Fi frequency, router with 802.11 B/G/N, a router within 50 feet of the myQ Smart Garage Hub (more details in PDF user manual)",
    "Guest access: Securely invite up to three people to control your garage with the myQ guest feature (Note: Not intended for guests under the age of 13)"
    ],
    "category": "appliances",
    "discount": true,
    "name": "MyQ Smart Garage Door Opener Chamberlain MYQ-G0301 - Wireless & Wi-Fi enabled Garage Hub with Smartphone Control, 1 Pack, Black",
    "price": 49.45
    },
    {
    "id": "McElH7fT3W7E5yWdjcRM",
    "name": "Fjallraven - Foldsack No. 1 Backpack, Fits 15 Laptops",
    "imgUrl": "https://fakestoreapi.com/img/81fPKd-2AYL._AC_SL1500_.jpg",
    "price": 109.95,
    "category": "men's clothing",
    "rating": 4.2,
    "discount": true,
    "feature": [
    "Your perfect pack for everyday use and walks in the forest. Stash your laptop (up to 15 inches) in the padded sleeve, your everyday"
    ],
    "originalPrice": 139.99
    },
    {
    "id": "RCTTqQfjrp1Y2LDcOXRw",
    "category": "toys",
    "price": 9.99,
    "imgUrl": "https://images-na.ssl-images-amazon.com/images/I/71oQ0b-4VmL._AC_SL1500_.jpg",
    "rating": 4.9,
    "name": "Disney Pixar \"Monsters, Inc.\" Mike Wazowski Plush",
    "discount": false,
    "originalPrice": null,
    "feature": [
    "Must-have plush for kids who love Disney and Pixar movies!",
    "A whole Disney and Pixar assortment of cuddling fun!",
    "Each doll is colorful and cuddly—a great gift for young kids",
    "Kids will love having a plush buddy for play time and nap time! Plush doll characters sold separately. Collect them for a Disney and Pixar plush entourage!"
    ]
    },
    {
    "id": "UMgFO6JNJfIUh5vVcMWE",
    "rating": 2.9,
    "price": 22.45,
    "imgUrl": "https://fakestoreapi.com/img/81XH0e8fefL._AC_UY879_.jpg",
    "category": "women's clothing",
    "originalPrice": 30,
    "discount": true,
    "name": "Lock and Love Women's Removable Hooded Faux Leather Moto Biker Jacket",
    "feature": [
    "100% POLYURETHANE(shell) 100% POLYESTER(lining) 75% POLYESTER 25% COTTON (SWEATER), Faux leather material for style and comfort / 2 pockets of front, 2-For-One Hooded denim style faux leather jacket, Button detail on waist / Detail stitching at sides, HAND WASH ONLY / DO NOT BLEACH / LINE DRY / DO NOT IRON"
    ]
    },
    {
    "id": "V5gzB2HMNTUuWNkp3V6K",
    "originalPrice": null,
    "imgUrl": "https://fakestoreapi.com/img/61IBBVJvSDL._AC_SY879_.jpg",
    "discount": false,
    "feature": [
    "USB 3.0 and USB 2.0 Compatibility Fast data transfers Improve PC Performance High Capacity",
    "Compatibility Formatted NTFS for Windows 10, Windows 8.1, Windows 7",
    "Reformatting may be required for other operating systems",
    "Compatibility may vary depending on user’s hardware configuration and operating system"
    ],
    "price": 64,
    "rating": 3.9,
    "category": "electronics",
    "name": "WD 2TB Elements Portable External Hard Drive - USB 3.0"
    },
    {
    "id": "VzDNBUeZ4zDy6kudQs2u",
    "price": 350,
    "imgUrl": "https://images-na.ssl-images-amazon.com/images/I/71vvXGmdKWL._AC_SL1500_.jpg",
    "feature": [
    "AMD Ryzen 3 3200U Dual Core Processor (Up to 3.5GHz); 4GB DDR4 Memory; 128GB PCIe NVMe SSD",
    "15.6 inches full HD (1920 x 1080) widescreen LED backlit IPS display; AMD Radeon Vega 3 Mobile Graphics",
    "1 USB 3.1 Gen 1 port, 2 USB 2.0 ports & 1 HDMI port with HDCP support",
    "802.11ac Wi-Fi; Backlit Keyboard; Up to 7.5 hours battery life, Windows 10 in S mode"
    ],
    "category": "electronics",
    "discount": true,
    "rating": 4.3,
    "name": "Acer Aspire 5 Slim Laptop, 15.6 inches Full HD IPS Display, AMD Ryzen 3 3200U, Vega 3 Graphics, 4GB DDR4, 128GB SSD, Backlit Keyboard, Windows 10 in S Mode, A515-43-R19L, Silver",
    "originalPrice": 429.99
    },
    {
    "id": "YmcwhCyxwsvEQmXOYrSH",
    "originalPrice": 59.99,
    "feature": [
    "Delivers gorgeous volume and brilliant shine in a single step",
    "3 Heat/Speed Settings + Cool option for styling flexibility. 1100-Watt power",
    "Unique oval brush design for smoothing the hair, while the round edges create volume. Designed with Nylon Pin & Tufted Bristles for detangling, improved volume and control. Unlike conventional hair dryers, this volumizer can be placed closer to the scalp for lift",
    "Safety First: The Revlon One Step Hair Dryer and Volumizer meets U.S. safety requirements and features the ETL Certification seal (look for the ‘test’ button on the plug which is required for all hair dryers in the U.S.)"
    ],
    "imgUrl": "https://images-na.ssl-images-amazon.com/images/I/71aXzv34N%2BL._SL1500_.jpg",
    "rating": 3.8,
    "price": 29.39,
    "name": "Revlon One-Step Hair Dryer And Volumizer Hot Air Brush, Black, Packaging May Vary",
    "discount": true,
    "category": "appliances"
    },
    {
    "id": "abcbav9f8KSBRIY3hGwk",
    "imgUrl": "https://images-na.ssl-images-amazon.com/images/I/71nDX36Y9UL._AC_SL1026_.jpg",
    "originalPrice": null,
    "category": "electronics",
    "price": 10.99,
    "rating": 4.1,
    "name": "AmazonBasics 36 Pack AAA High-Performance Alkaline Batteries, 10-Year Shelf Life, Easy to Open Value Pack",
    "discount": false,
    "feature": [
    "AAA 1.5-volt performance alkaline batteries; ideal for a variety of devices, including game controllers, toys, flashlights, digital cameras, and clocks",
    "10-year leak-free shelf life; air- and liquid-tight seal locks in the power until it’s needed thanks to the improved design, which includes dual crimps, a new zinc composition, and anti-corrosion components",
    "Delivers the amount of power needed for a specific device; ideal for game controllers, toys, flashlights, digital cameras, clocks, and more",
    "Note: these batteries are NOT rechargeable. For reusable options, check out AmazonBasics rechargeable batteries"
    ]
    },
    {
    "id": "dz2bcGSmSiVkUc7VoMxZ",
    "category": "electronics",
    "name": "Samsung Galaxy S20 5G Factory Unlocked New Android Cell Phone US Version, 128GB of Storage, Fingerprint ID and Facial Recognition, Long-Lasting Battery, Cosmic Gray",
    "rating": 4.6,
    "originalPrice": null,
    "price": 687.76,
    "discount": false,
    "feature": [
    "Power of 5G: Get next-level power for everything you love to do with Samsung Galaxy 5G; Share more, game harder, experience more and never miss a beat",
    "Single Take AI: Capture video and multiple types of images with one tap of the shutter button; Lenses, effects and filters capture the best of every moment, every time",
    "Bright Night Mode: Capture crisp images and vibrant video in Bright Night mode and create high-quality content in low light – no flash needed",
    "Super Fast Charging: Charge up quicker with Super Fast Charge so you can keep moving with more juice; Give your buds – or Galaxy buds – a boost of power with Wireless PowerShare right from Galaxy S20 5G"
    ],
    "imgUrl": "https://images-na.ssl-images-amazon.com/images/I/71h1NfW14xL._AC_SL1500_.jpg"
    },
    {
    "id": "ivT8n7LAPBBeCC1jEUqk",
    "rating": 4.3,
    "feature": [
    "21. 5 inches Full HD (1920 x 1080) widescreen IPS display And Radeon free Sync technology.",
    "No compatibility for VESA Mount Refresh Rate: 75Hz - Using HDMI port Zero-frame design | ultra-thin | 4ms response time | IPS panel Aspect ratio - 16: 9. Color Supported - 16. 7 million colors.",
    "Brightness - 250 nit Tilt angle -5 degree to 15 degree. Horizontal viewing angle-178 degree. Vertical viewing angle-178 degree 75 hertz"
    ],
    "imgUrl": "https://fakestoreapi.com/img/81QpkIctqPL._AC_SX679_.jpg",
    "name": "Acer SB220Q bi 21.5 inches Full HD (1920 x 1080) IPS Ultra-Thin",
    "discount": false,
    "category": "electronics",
    "price": 599,
    "originalPrice": null
    },
    {
    "id": "kCUCwqpTdsBW3zxEDudp",
    "price": 22.3,
    "originalPrice": null,
    "name": "Mens Casual Premium Slim Fit T-Shirts",
    "category": "men's clothing",
    "imgUrl": "https://fakestoreapi.com/img/71-3HjGNDUL._AC_SY879._SX._UX._SY._UY_.jpg",
    "feature": [
    "Slim-fitting style, contrast raglan long sleeve, three-button henley placket, light weight & soft fabric for breathable and comfortable wearing. And Solid stitched shirts with round neck made for durability and a great fit for casual fashion wear and diehard baseball fans.",
    "The Henley style round neckline includes a three-button placket."
    ],
    "rating": 4.6,
    "discount": false
    },
    {
    "id": "ldFnAvW9eAMxGPwcm9ch",
    "imgUrl": "https://fakestoreapi.com/img/71li-ujtlUL._AC_UX679_.jpg",
    "name": "Mens Cotton Jacket",
    "category": "men's clothing",
    "feature": [
    "Great outerwear jackets for Spring/Autumn/Winter, suitable for many occasions, such as working, hiking, camping, mountain/rock climbing, cycling, traveling or other outdoors.",
    "Good gift choice for you or your family member.",
    "A warm hearted love to Father, husband or son in this thanksgiving or Christmas Day."
    ],
    "price": 55.99,
    "rating": 3.5,
    "discount": true,
    "originalPrice": 72
    },
    {
    "id": "m4sJkCw8pe7U9qWv4XJI",
    "originalPrice": 999.99,
    "name": "Samsung 49-Inch CHG90 144Hz Curved Gaming Monitor (LC49HG90DMNXZA) – Super Ultrawide Screen QLED",
    "price": 899.99,
    "category": "electronics",
    "imgUrl": "https://fakestoreapi.com/img/81Zt42ioCgL._AC_SX679_.jpg",
    "feature": [
    "49 INCH SUPER ULTRAWIDE 32:9 CURVED GAMING MONITOR with dual 27 inch screen side by side QUANTUM DOT (QLED) TECHNOLOGY",
    "HDR support and factory calibration provides stunningly realistic and accurate color and contrast 144HZ HIGH REFRESH RATE and 1ms ultra fast response time work to eliminate motion blur, ghosting, and reduce input lag"
    ],
    "rating": 3.8,
    "discount": true
    },
    {
    "id": "n67cLEmuldjdSNK0p9bq",
    "price": 21.99,
    "imgUrl": "https://images-na.ssl-images-amazon.com/images/I/91oiSVwU7OL._AC_SL1500_.jpg",
    "name": "AmazonBasics Stainless Steel Portable Fast, Electric Hot Water Kettle for Tea and Coffee, 1 Liter, Silver",
    "rating": 3.2,
    "discount": false,
    "category": "appliances",
    "originalPrice": null,
    "feature": [
    "Cordless design allows for easy filling and serving; Power base with 30-inch power cord for flexible placement, plus cord wrap for compact storage",
    "Electric water kettle with 1.0-liter capacity and 1500 watts of power for fast results (120V-60Hz)",
    "Concealed heating element; BPA-free food-contact materials; Removable filter for easy cleaning",
    "Automatic shutoff with boil-dry protection for safety and peace of mind; Water window for precise filling and checking levels at a glance"
    ]
    },
    {
    "id": "nfbFS0CZ8GCxrk7XHCdc",
    "category": "electronics",
    "originalPrice": null,
    "discount": false,
    "rating": 4.3,
    "price": 69.96,
    "imgUrl": "https://images-na.ssl-images-amazon.com/images/I/71y%2BUGuJl5L._SL1500_.jpg",
    "feature": [
    "Haptic feedback** - Feel physically responsive feedback to your in-game actions with dual actuators which replace traditional rumble motors. In your hands, these dynamic vibrations can simulate the feeling of everything from environments to the recoil of different weapons.",
    "Adaptive triggers** - Experience varying levels of force and tension as you interact with your in-game gear and environments. From pulling back an increasingly tight bowstring to hitting the brakes on a speeding car, feel physically connected to your on-screen actions.",
    "Built-in microphone and headset jack - Chat with friends online*** using the built-in microphone or by connecting a headset to the 3.5mm jack. Easily switch voice capture on and off at a moment’s notice with the dedicated mute button",
    "Internet and account for PlayStation Network required"
    ],
    "name": "DualSense Wireless Controller - Click. Charge. Play. Wireless Controller for Play Station 5 White"
    },
    {
    "id": "oCb3F9gGzPJI6LUh3eHk",
    "originalPrice": 67.33,
    "discount": false,
    "imgUrl": "https://fakestoreapi.com/img/51Y5NI-I5jL._AC_UX679_.jpg",
    "name": "BIYLACLESEN Women's 3-in-1 Snowboard Jacket Winter Coats",
    "category": "women's clothing",
    "feature": [
    "Note: The Jackets is US standard size, Please choose size as your usual wear",
    "Material: 100% Polyester; Detachable Liner Fabric: Warm Fleece. Detachable Functional Liner: Skin Friendly, Lightweigt and Warm",
    "Zippered Pockets: 2 Zippered Hand Pockets, 2 Zippered Pockets on Chest (enough to keep cards or keys)and 1 Hidden Pocket Inside.Zippered Hand Pockets and Hidden Pocket keep your things secure.",
    "Humanized Design: Adjustable and Detachable Hood and Adjustable cuff to prevent the wind and water,for a comfortable fit."
    ],
    "rating": 4.1,
    "price": 56.99
    },
    {
    "id": "q395MQYXnHzku7gK9RL8",
    "imgUrl": "https://fakestoreapi.com/img/71YAIFU48IL._AC_UL640_QL65_ML3_.jpg",
    "category": "jewellery",
    "feature": [
    "Classic Created Wedding Engagement Solitaire Diamond Promise Ring for Her. Gifts to spoil your love more for Engagement, Wedding, Anniversary, Valentine's Day..."
    ],
    "rating": 4.1,
    "name": "White Gold Plated Princess",
    "price": 9.99,
    "originalPrice": null,
    "discount": false
    },
    {
    "id": "qhcJ3vwde53UuCcR1IZ0",
    "imgUrl": "https://images-na.ssl-images-amazon.com/images/I/81%2BjNVOUsJL._AC_SL1500_.jpg",
    "feature": [
    "Three levels of world-class noise cancellation for better listening experience in any environment",
    "Alexa-enabled for voice access to music, information, and more",
    "Noise-rejecting dual-microphone system for clear sound and voice pick-up",
    "Hassle-free Bluetooth pairing, personalized settings, access to future updates, and more through the Bose connect app"
    ],
    "name": "Bose QuietComfort 35 II Wireless Bluetooth Headphones, Noise-Cancelling, with Alexa voice control - Black",
    "rating": 4.7,
    "price": 299,
    "category": "electronics",
    "discount": true,
    "originalPrice": 349
    },
    {
    "id": "sOQfbKYk7Zhrvq66uMzD",
    "category": "women's clothing",
    "price": 7.95,
    "feature": [
    "100% Polyester, Machine wash, 100% cationic polyester interlock, Machine Wash & Pre Shrunk for a Great Fit, Lightweight, roomy and highly breathable with moisture wicking fabric which helps to keep moisture away, Soft Lightweight Fabric with comfortable V-neck collar and a slimmer fit, delivers a sleek, more feminine silhouette and Added Comfort"
    ],
    "rating": 3.6,
    "name": "Opna Women's Short Sleeve Moisture",
    "originalPrice": null,
    "discount": false,
    "imgUrl": "https://fakestoreapi.com/img/51eg55uWmdL._AC_UX679_.jpg"
    },
    {
    "id": "uiFWM0jYyqACKnSg0a3J",
    "category": "women's clothing",
    "name": "Rain Jacket Women Windbreaker Striped Climbing Raincoats",
    "imgUrl": "https://fakestoreapi.com/img/71HblAHs5xL._AC_UY879_-2.jpg",
    "price": 39.99,
    "originalPrice": null,
    "rating": 3.3,
    "discount": false,
    "feature": [
    "Lightweight perfet for trip or casual wear---Long sleeve with hooded, adjustable drawstring waist design.",
    "Button and zipper front closure raincoat, fully stripes Lined and The Raincoat has 2 side pockets are a good size to hold all kinds of things, it covers the hips, and the hood is generous but doesn't overdo it.",
    "Attached Cotton Lined Hood with Adjustable Drawstrings give it a real styled look."
    ]
    }
]    